{
    "architectures": [
      "BertForSequenceClassification"
    ],
    "attention_probs_dropout_prob": 0.1,
    "directionality": "bidi",
    "gradient_checkpointing": false,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 1024,
    "id2label" : {
        "-1": "negative",
        "1" : "positve"
    },
    "initializer_range": 0.02,
    "intermediate_size": 4096,
    "label2id" : {
        "LABEL_0": -1,
        "LABEL_1": 1
    },
    "layer_norm_eps": 1e-12,
    "max_position_embeddings": 300,
    "model_type": "bert",
    "num_attention_heads": 16,
    "num_hidden_layers": 24,
    "pad_token_id": 0,
    "type_vocab_size": 2,
    "vocab_size": 30000
  }